"""
트레이딩 조건 설정 파일
"""

######################################################
####################    매수   ########################
######################################################

# 매수 조건 퍼센테이지
BUY_PERCENT = 0.92
# 매수 주문 후 대기 / 초
BUY_WAIT = 20
# N일 전 상한가 종목으로 매수
BUY_DAY_AGO = 2
# 매수 횟수(최초 9회였음)
COUNT = 6



######################################################
####################    매도   ########################
######################################################

#selling_point_1 이상일 때 1차 매도 - 일단 이것만 사용
SELLING_POINT = 1.10

#selling_point_1 이상일 때 1차 매도 - 일단 이것만 사용
RISK_MGMT = 0.93

# 매도 주문 후 대기 / 초
SELL_WAIT = 3

# 매수 시작일로부터 days_later일 후 매도
DAYS_LATER = 7 #마지막 매수로부터 4(7-3)일째 매도


######################################################
##################    스케줄링   ######################
######################################################

# 상한가 종목 받아오는 시간
GET_ULS_HOUR = 12
GET_ULS_MINUTE = 8
# 상한가 종목 중 선별하는 시간
GET_SELECT_HOUR = 12
GET_SELECT_MINUTE = 9

# 매수 시간 1
ORDER_HOUR_1 = 12
ORDER_MINUTE_1 = 30
# 매수 시간 2
ORDER_HOUR_2 = 13
ORDER_MINUTE_2 = 30
# 매수 시간 3
ORDER_HOUR_3 = 15
ORDER_MINUTE_3 = 00



###############################################################
###############################################################


# 상승 눌림목 매매
SLOT_UPPER = 2

BUY_DAY_AGO_UPPER = 1